app/controllers/dynamic_routs_controller.rb

SELECT * FROM `router_infos` WHERE (`router_infos`.`id` = 1)
DELETE FROM `router_infos` WHERE `id` = 1
---
  def deleteroute
      @dyn_route = RouterInfo.find(params[:id])
      @dyn_route.destroy

SELECT * FROM `router_infos` WHERE (`router_infos`.`id` = 1)
---
  def editroute
     @dirname=(File.dirname("C:\\ruby\\rdr2_3_2\\app\\controllers\\.")).to_s
     @arr=Dir.entries(@dirname)
     $array=Array.new
  	 for i in 0..@arr.length-1
  	 if @arr[i]=="." or @arr[i]==".."
  	    @arr.delete("@arr[i]")
  	 else
  	   $array[i-2]=@arr[i].gsub(".rb","")
  	 end
  	end
  	for i in 0..$array.length-1
  	$array[i]=$array[i].gsub("_controller","")
  	end
    $dyn_route = RouterInfo.find(params[:id])

SELECT * FROM `router_infos` WHERE (`router_infos`.`id` = 3)
UPDATE `router_infos` SET `router_action` = 'updateroute', `updated_at` = '2009-09-03 11:53:05' WHERE `id` = 4
---
  def updateroute
        logger.info("ROUTE Value : ")
        @routerinfo = RouterInfo.find(params[:routerinfo][:id])
       if @routerinfo.update_attributes(params[:routerinfo])

INSERT INTO `router_infos` (`router_action`, `updated_at`, `router_url`, `router_controller`, `created_at`) VALUES('updateroute', '2009-09-03 07:16:17', 'updateR', 'dynamic_routs', '2009-09-03 07:16:17')
---
  def create_route
      return unless request.post?
      @routerinfo = RouterInfo.new(params[:routerinfo])
      respond_to do |format|
        if @routerinfo.save